In [1]:
import pandas as pd
import numpy as np

In [9]:
df1 = pd.DataFrame({
    'city':['aman1','shyam1','monu1'],
    'temperature':[32,43,33],
})

df1

     city  temperature
0   aman1           32
1  shyam1           43
2   monu1           33

In [14]:
df2 = pd.DataFrame({
    'city':['aman1','shyam1','monu1'],
    'windspeed':[81,20,75]

})

df2

     city  windspeed
0   aman1         81
1  shyam1         20
2   monu1         75

In [15]:
df3 = pd.merge(df1,df2)   # by default perform inner joining
df3

     city  temperature  windspeed
0   aman1           32         81
1  shyam1           43         20
2   monu1           33         75

In [16]:
df3 = pd.merge(df1,df2,on='city')   # by default perform inner joining on keyword optional
df3

     city  temperature  windspeed
0   aman1           32         81
1  shyam1           43         20
2   monu1           33         75

In [17]:
df1 = pd.DataFrame({
    'city':['aman1','shyam1','monu1'],
    'temperature':[32,43,33],
})

df1

     city  temperature
0   aman1           32
1  shyam1           43
2   monu1           33

In [18]:
df2 = pd.DataFrame({
    'city':['aman1','shyam2','monu1'],
    'windspeed':[81,20,75]

})

df2

     city  windspeed
0   aman1         81
1  shyam2         20
2   monu1         75

In [19]:
df3 = pd.merge(df1,df2,on='city')
df3

    city  temperature  windspeed
0  aman1           32         81
1  monu1           33         75

# left right  outer joining

In [20]:
df1 = pd.DataFrame({
    'city':['aman1','shyam1','monu1'],
    'temperature':[32,43,33],
})

df1

     city  temperature
0   aman1           32
1  shyam1           43
2   monu1           33

In [21]:
df2 = pd.DataFrame({
    'city':['aman1','shyam2','monu1'],
    'windspeed':[81,20,75]

})

df2

     city  windspeed
0   aman1         81
1  shyam2         20
2   monu1         75

In [22]:
df3 = pd.merge(df1,df2,on='city',how='left')
df3

     city  temperature  windspeed
0   aman1           32       81.0
1  shyam1           43        NaN
2   monu1           33       75.0

In [23]:
df3 = pd.merge(df1,df2,on='city', how='right')
df3

     city  temperature  windspeed
0   aman1         32.0         81
1  shyam2          NaN         20
2   monu1         33.0         75

In [24]:
df3 = pd.merge(df1,df2,on='city', how='outer')
df3

     city  temperature  windspeed
0   aman1         32.0       81.0
1  shyam1         43.0        NaN
2   monu1         33.0       75.0
3  shyam2          NaN       20.0

In [25]:
df3 = pd.merge(df1,df2,on='city', how='outer', indicator=True)
df3

     city  temperature  windspeed      _merge
0   aman1         32.0       81.0        both
1  shyam1         43.0        NaN   left_only
2   monu1         33.0       75.0        both
3  shyam2          NaN       20.0  right_only